michpro/arduino_libraries/GD32CAN/GD32CAN.cpp
/**
 * @file        GD32CAN.cpp
 * @brief       GD32F30x and GD32E50x CAN bus library implementation.
 *
 * @copyright   SPDX-FileCopyrightText: Copyright 2024-2026 Michal Protasowicki
 * @license     SPDX-License-Identifier: MIT
 */

#include "GD32CAN.h"

//*******************************************************************
//*                                                                 *
//*                         Free Functions                          *
//*                                                                 *
//*******************************************************************

//*************************** Ring Buffer ***************************

/**
 * @brief Initializes a ring buffer structure.
 * @param ring Reference to the ringBuffer_t to initialize.
 * @param buffer Pointer to the allocated memory array for messages.
 * @param size Size of the allocated buffer (number of messages).
 */
void initRingBuffer(volatile CAN::ringBuffer_t &ring, volatile CAN::message_t *buffer, uint32_t size);

/**
 * @brief Checks if the ring buffer is empty.
 * @param ring The ring buffer to check.
 * @return true if empty, false otherwise.
 */
bool isRingBufferEmpty(volatile CAN::ringBuffer_t &ring);

/**
 * @brief Checks if the ring buffer is full.
 * @param ring The ring buffer to check.
 * @return true if full, false otherwise.
 */
bool isRingBufferFull(volatile CAN::ringBuffer_t &ring);

/**
 * @brief Returns the number of elements currently in the ring buffer.
 * @param ring The ring buffer to count.
 * @return uint32_t Number of elements.
 */
uint32_t ringBufferCount(volatile CAN::ringBuffer_t &ring);

/**
 * @brief Adds a message to the ring buffer.
 * @param ring The ring buffer.
 * @param message The message to add.
 * @return true if added successfully, false if buffer is full.
 */
bool addToRingBuffer(volatile CAN::ringBuffer_t &ring, const CAN::message_t &message);

/**
 * @brief Reads a message from the ring buffer (peeks at tail).
 * Note: Does not increment the tail pointer (remove element).
 * @param ring The ring buffer.
 * @param message Reference to store the read message.
 * @return true if message read, false if buffer empty.
 */
bool readFromRingBuffer(volatile CAN::ringBuffer_t &ring, CAN::message_t &message);

/**
 * @brief Removes the oldest message from the ring buffer (increments tail).
 * @param ring The ring buffer.
 */
void removeFromRingBuffer(volatile CAN::ringBuffer_t &ring);

//*************************** CAN message ***************************

/**
 * @brief Transmits a CAN message directly using hardware mailboxes.
 * @param canPeriph The base address of the CAN peripheral.
 * @param message The message object to transmit.
 * @return true if placed in a mailbox, false if all mailboxes are full.
 */
bool canMessageTransmit(uint32_t canPeriph, const CAN::message_t &message);

/**
 * @brief Reads a CAN message from a specific hardware FIFO.
 * @param canPeriph The base address of the CAN peripheral.
 * @param fifo The FIFO number (0 or 1) to read from.
 * @param rx_message Pointer to the destination message object.
 */
void canMessageReceive(uint32_t canPeriph, uint8_t fifo, CAN::message_t *rx_message);

//*******************************************************************

namespace CAN
{
    #ifdef HAS_CAN0
    volatile CAN::ringBuffer_t *can0TxRing          {nullptr};
    volatile CAN::ringBuffer_t *can0RxRing          {nullptr};
    volatile bool               can0rxIrqEnabled    {false};
    #endif
    #ifdef HAS_CAN1
    volatile CAN::ringBuffer_t *can1TxRing          {nullptr};
    volatile CAN::ringBuffer_t *can1RxRing          {nullptr};
    volatile bool               can1rxIrqEnabled    {false};
    #endif
    #ifdef HAS_CAN2
    volatile CAN::ringBuffer_t *can2TxRing          {nullptr};
    volatile CAN::ringBuffer_t *can2RxRing          {nullptr};
    volatile bool               can2rxIrqEnabled    {false};
    #endif

    namespace Filter
    {
        static const uint16_t   SFID_SHIFT          {5};
        static const uint32_t   EFID_SHIFT          {3};
        static const uint32_t   HALFWORD_SHIFT      {sizeof(uint16_t) * __CHAR_BIT__};
        static const uint16_t   SHORT_FILTER_SHIFT  {3};
        static const uint32_t   TEST_RTR_FIELD      {Frame::Type::RTR};
    }
}

uint_fast8_t    GD32CAN::instances          {0x00};
int_fast8_t     GD32CAN::can1StartFilterId  {-1};

GD32CAN::GD32CAN(CAN::Device::device_t device)
{
    init(device, CAN::QueueSize::Q_64, static_cast<CAN::QueueSize::size_t>(0));
}

GD32CAN::GD32CAN(CAN::Device::device_t device, CAN::QueueSize::size_t rxQueueSize)
{
    init(device, rxQueueSize, static_cast<CAN::QueueSize::size_t>(0));
}

GD32CAN::GD32CAN(CAN::Device::device_t device, CAN::QueueSize::size_t rxQueueSize, CAN::QueueSize::size_t txQueueSize)
{
    init(device, rxQueueSize, txQueueSize);
}

GD32CAN::~GD32CAN(void)
{
    if (true == _isInstanceAllowed)
    {
        #if defined(HAS_CAN1)
        if ((CAN::Device::CAN_1_DEFAULT == _device) || (CAN::Device::CAN_1_ALT1 == _device))
        {
            can1StartFilterId = -1;
        }
        #endif
        
        delete[] _rxBuffer;
        delete[] _txBuffer;
        
        detachTransceiverSleepPin();
        canDeinit();
        nvicConfig(CAN::State::DISABLE);
        gpioConfig(CAN::State::DISABLE);
        instances &= ~_instance_mask;
    }
}

/**
 * @brief Internal initialization method called by constructors.
 * allocates memory for buffers and sets up instance pointers.
 */
void GD32CAN::init(const CAN::Device::device_t device, CAN::QueueSize::size_t rxQueueSize, CAN::QueueSize::size_t txQueueSize)
{
    _device = device;
    _deviceBase = ((uint32_t)_device) & CAN_DEVICE_MASK;

    // Reset pointers before allocation to avoid double delete issues if init is called oddly
    _rxBuffer = nullptr;
    _txBuffer = nullptr;

    _rxBuffer = ((uint32_t)rxQueueSize > 0) ? (new CAN::message_t[(uint32_t)rxQueueSize]) : nullptr;
    initRingBuffer(_rxRing, _rxBuffer, (uint32_t)rxQueueSize);

    _txBuffer = ((uint32_t)txQueueSize > 0) ? (new CAN::message_t[(uint32_t)txQueueSize]) : nullptr;
    initRingBuffer(_txRing, _txBuffer, (uint32_t)txQueueSize);

    switch (_device)
    {
    #if defined(HAS_CAN1)
        case CAN::Device::CAN_1_DEFAULT:
        case CAN::Device::CAN_1_ALT1:
            CAN::can1TxRing = &_txRing;
            CAN::can1RxRing = &_rxRing;
            _rxIrqEnabled = &(CAN::can1rxIrqEnabled);
            _instance_mask = INSTANCES_MASK_CAN1;
            can1StartFilterId = DEFAULT_CAN1_START_FILTER_ID;
            _firstFilterId = DEFAULT_CAN1_START_FILTER_ID;
            break;
    #endif
    #if defined(HAS_CAN2)
        case CAN::Device::CAN_2_DEFAULT:
        case CAN::Device::CAN_2_ALT1:
        #if defined(PE0)
        case CAN::Device::CAN_2_ALT2:
        #endif
            CAN::can2TxRing = &_txRing;
            CAN::can2RxRing = &_rxRing;
            _rxIrqEnabled = &(CAN::can2rxIrqEnabled);
            _instance_mask = INSTANCES_MASK_CAN2;
            break;
    #endif
        default:
            CAN::can0TxRing = &_txRing;
            CAN::can0RxRing = &_rxRing;
            _rxIrqEnabled = &(CAN::can0rxIrqEnabled);
            _instance_mask = INSTANCES_MASK_CAN0;
            break;
    }

    _isInstanceAllowed = (0x00 == (instances & _instance_mask));
    instances |= _instance_mask;
}

