michpro/arduino_libraries/GD32CAN/GD32CAN.cpp
bool GD32CAN::begin(const CAN::Baudrate::baudrate_t baudrate)
{
    bool result {_isInstanceAllowed};

    if (true == result)
    {
        gpioConfig(CAN::State::ENABLE);
        nvicConfig(CAN::State::ENABLE);
        result = canConfig(baudrate);

        _isInitialized = result;
    }

    return result;
}

bool GD32CAN::isInitialized(void)
{
    return _isInitialized;
}

bool GD32CAN::attachTransceiverSleepPin(const pin_size_t pin)
{
    bool result {_isInstanceAllowed};

    if (true == result)
    {
        _transceiverSleepPin = pin;
        digitalWrite(_transceiverSleepPin, HIGH);
        pinMode(_transceiverSleepPin, OUTPUT);
    }

    return result;
}

bool GD32CAN::setTransceiverMode(const CAN::State::state_t state)
{
    bool result {_isInitialized && (NO_PIN != _transceiverSleepPin)};

    if (true == result)
    {
        digitalWrite(_transceiverSleepPin, ((CAN::State::ENABLE == state) ? LOW : HIGH));
    }

    return result;
}

bool GD32CAN::setWorkingMode(const CAN::WorkingMode::mode_t mode)
{
    return (_isInitialized ? (SUCCESS == can_working_mode_set(_deviceBase, (uint8_t)mode)) : false);
}

bool GD32CAN::setBaudrate(const CAN::Baudrate::baudrate_t baudrate)
{
    bool result {_isInitialized};

    if ((true == result) && ((uint32_t)baudrate <= HW_MAX_BAUDRATE))          // The maximum baud rate support to 1M
    {
        if (true == setWorkingMode(CAN::WorkingMode::INITIALIZE))
        {
            uint32_t regTemp    {CAN_BT(_deviceBase) & (CAN_BT_LCMOD | CAN_BT_SCMOD)};
            uint32_t canBtVal   {calculateCANBTRegValue(baudrate)};

            if (0 != canBtVal)
            {
                CAN_BT(_deviceBase) = (regTemp | canBtVal);
                result = true;
            } 
        }
        result = (setWorkingMode(CAN::WorkingMode::NORMAL)) ? result : false;
    }

    return result;
}

bool GD32CAN::clearAllFilters(void)
{
    bool result {_isInstanceAllowed};

    if ((true == result) && (_firstFilterId >= 0))
    {
        int_fast8_t maxFilterId {getMaxFilterId()};

        if ((_firstFilterId >= 0) && (maxFilterId >= 0))
        {
            for (int_fast8_t idx = _firstFilterId; idx <= maxFilterId; idx++)
            {
                setFilter(  (CAN::Filter::Bank::filter_t)idx,
                            (uint32_t)0x00000000U,
                            (uint32_t)0x00000000U,
                            CAN::Filter::Mode::MASK,
                            FILTERBITS_32,
                            CAN::State::DISABLE);
            }
        }
    }

    return result;
}

bool GD32CAN::disableFilter(const CAN::Filter::Bank::filter_t filterId)
{
    return setFilterState(filterId, CAN::State::DISABLE);
}

bool GD32CAN::enableFilter(const CAN::Filter::Bank::filter_t filterId)
{
    uint32_t    mask    {(uint32_t)(1 << (uint32_t)filterId)};
    bool        result  {0 != (_filtersStates & mask)};

    return (result ? setFilterState(filterId, CAN::State::ENABLE) : result);
}

bool GD32CAN::allowReceiveAllMessages(CAN::Filter::Id::idType_t idType)
{
    bool result {_isInstanceAllowed};

    if ((true == result) && (_firstFilterId >= 0))
    {
        const uint32_t  ID_TYPE_MASK    {CAN::Filter::Id::EXTENDED};
        uint32_t        id              {(CAN::Filter::Id::EXTENDED == idType) ? (uint32_t)CAN::Filter::Id::EXTENDED : 0x00000000U};
        uint32_t        mask            {(CAN::Filter::Id::ALL == idType) ? 0x00000000U : ID_TYPE_MASK};

        setFilter(  (CAN::Filter::Bank::filter_t)_firstFilterId, 
                    id,
                    mask,
                    CAN::Filter::Mode::MASK,
                    FILTERBITS_32,
                    CAN::State::ENABLE
                 );
    }

    return result;
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint32_t frameId, const CAN::Filter::FrameType::filteredFrames_t filteredFrames)
{
    return setFilter(filterId, frameId, CAN::Frame::EFID_MASK, filteredFrames);
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint32_t frameId_1, const CAN::Frame::Type::frameType_t frameType_1,
                                                                    const uint32_t frameId_2, const CAN::Frame::Type::frameType_t frameType_2)
{
    uint32_t    id_1        {(frameId_1 << CAN::Filter::EFID_SHIFT) | (uint32_t)CAN::Frame::Id::EXTENDED | (uint32_t)frameType_1};
    uint32_t    id_2        {(frameId_2 << CAN::Filter::EFID_SHIFT) | (uint32_t)CAN::Frame::Id::EXTENDED | (uint32_t)frameType_2};
    bool        canApply    {(frameId_1 <= CAN::Frame::EFID_MASK) && (frameId_2 <= CAN::Frame::EFID_MASK)};

    return (canApply ? setFilter(filterId, id_1, id_2, CAN::Filter::Mode::LIST, FILTERBITS_32, CAN::State::ENABLE) : false);
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint32_t frameId, const uint32_t frameIdMask, const CAN::Filter::FrameType::filteredFrames_t filteredFrames)
{
    uint32_t id     {(frameId << CAN::Filter::EFID_SHIFT) | (uint32_t)CAN::Frame::Id::EXTENDED};
    uint32_t mask   {(frameIdMask << CAN::Filter::EFID_SHIFT) | (uint32_t)CAN::Frame::Id::EXTENDED};

    if (CAN::Filter::FrameType::ANY != filteredFrames)
    {
        id |= (uint32_t)filteredFrames;
        mask |= CAN::Filter::TEST_RTR_FIELD;
    }

    return (frameId <= CAN::Frame::EFID_MASK) ? setFilter(filterId, id, mask, CAN::Filter::Mode::MASK, FILTERBITS_32, CAN::State::ENABLE) : false;
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId, const CAN::Filter::FrameType::filteredFrames_t filteredFrames)
{
    return setFilter(filterId, frameId, CAN::Frame::SFID_MASK, filteredFrames, frameId, CAN::Frame::SFID_MASK, filteredFrames);
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId_1, const CAN::Filter::FrameType::filteredFrames_t filteredFrames_1,
                                                                    const uint16_t frameId_2, const CAN::Filter::FrameType::filteredFrames_t filteredFrames_2)
{
    return setFilter(filterId, frameId_1, CAN::Frame::SFID_MASK, filteredFrames_1, frameId_2, CAN::Frame::SFID_MASK, filteredFrames_2);
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId_1, const CAN::Frame::Type::frameType_t frameType_1,
                                                                    const uint16_t frameId_2, const CAN::Frame::Type::frameType_t frameType_2,
                                                                    const uint16_t frameId_3, const CAN::Frame::Type::frameType_t frameType_3,
                                                                    const uint16_t frameId_4, const CAN::Frame::Type::frameType_t frameType_4)
{
    uint16_t    id_1        {(uint16_t)((frameId_1 << CAN::Filter::SFID_SHIFT) | ((uint16_t)frameType_1 << CAN::Filter::SHORT_FILTER_SHIFT))};
    uint16_t    id_2        {(uint16_t)((frameId_2 << CAN::Filter::SFID_SHIFT) | ((uint16_t)frameType_2 << CAN::Filter::SHORT_FILTER_SHIFT))};
    uint16_t    id_3        {(uint16_t)((frameId_3 << CAN::Filter::SFID_SHIFT) | ((uint16_t)frameType_3 << CAN::Filter::SHORT_FILTER_SHIFT))};
    uint16_t    id_4        {(uint16_t)((frameId_4 << CAN::Filter::SFID_SHIFT) | ((uint16_t)frameType_4 << CAN::Filter::SHORT_FILTER_SHIFT))};
    uint32_t    id_1_2      {((uint32_t)id_1 << CAN::Filter::HALFWORD_SHIFT) | (uint32_t)id_2};
    uint32_t    id_3_4      {((uint32_t)id_3 << CAN::Filter::HALFWORD_SHIFT) | (uint32_t)id_4};
    bool        canApply    {   (frameId_1 <= CAN::Frame::SFID_MASK) && (frameId_2 <= CAN::Frame::SFID_MASK)
                             && (frameId_3 <= CAN::Frame::SFID_MASK) && (frameId_4 <= CAN::Frame::SFID_MASK)};

