michpro/arduino_libraries/GD32CAN/GD32CAN.cpp
    return (canApply ? setFilter(filterId, id_1_2, id_3_4, CAN::Filter::Mode::LIST, FILTERBITS_16, CAN::State::ENABLE) : false);
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId, const uint16_t frameIdMask, const CAN::Filter::FrameType::filteredFrames_t filteredFrames)
{
    return setFilter(filterId, frameId, frameIdMask, filteredFrames, frameId, frameIdMask, filteredFrames);
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint16_t frameId_1, const uint16_t frameIdMask_1, const CAN::Filter::FrameType::filteredFrames_t filteredFrames_1,
                                                                    const uint16_t frameId_2, const uint16_t frameIdMask_2, const CAN::Filter::FrameType::filteredFrames_t filteredFrames_2)
{
    uint16_t    id_1        {(uint16_t)(frameId_1 << CAN::Filter::SFID_SHIFT)};
    uint16_t    mask_1      {(uint16_t)(frameIdMask_1 << CAN::Filter::SFID_SHIFT)};
    uint16_t    id_2        {(uint16_t)(frameId_2 << CAN::Filter::SFID_SHIFT)};
    uint16_t    mask_2      {(uint16_t)(frameIdMask_2 << CAN::Filter::SFID_SHIFT)};
    bool        canApply    {(frameId_1 <= CAN::Frame::SFID_MASK) && (frameId_2 <= CAN::Frame::SFID_MASK)};

    if (CAN::Filter::FrameType::ANY != filteredFrames_1)
    {
        id_1 |= ((uint32_t)filteredFrames_1 << CAN::Filter::SHORT_FILTER_SHIFT);
        mask_1 |= (CAN::Filter::TEST_RTR_FIELD << CAN::Filter::SHORT_FILTER_SHIFT);
    }
    if (CAN::Filter::FrameType::ANY != filteredFrames_2)
    {
        id_2 |= ((uint32_t)filteredFrames_2 << CAN::Filter::SHORT_FILTER_SHIFT);
        mask_2 |= (CAN::Filter::TEST_RTR_FIELD << CAN::Filter::SHORT_FILTER_SHIFT);
    }

    uint32_t    id          {((uint32_t)id_1 << CAN::Filter::HALFWORD_SHIFT) | (uint32_t)id_2};
    uint32_t    mask        {((uint32_t)mask_1 << CAN::Filter::HALFWORD_SHIFT) | (uint32_t)mask_2};

    return canApply ? setFilter(filterId, id, mask, CAN::Filter::Mode::MASK, FILTERBITS_16, CAN::State::ENABLE) : false;
}

bool GD32CAN::write(CAN::message_t &message)
{
    bool result {_isInitialized};

    if (true == result)
    {
        bool sentDirectly {false};

        // Optimisation: If ring buffer is empty, try to write directly to hardware
        if (isRingBufferEmpty(_txRing)) 
        {
            if (canMessageTransmit(_deviceBase, message)) 
            {
                sentDirectly = true;
            }
        }

        if (!sentDirectly) 
        {
            // If hardware was full or buffer had data, append to buffer
            if (nullptr != _txRing.buffer)
            {
                result = addToRingBuffer(_txRing, message);

                // Only enable "Mailbox Empty" interrupt if we have data pending in the buffer.
                // Enabling it when buffer is empty causes an infinite ISR loop (ISR Storm).
                // We enable it AFTER adding to buffer.
                if (true == result) 
                {
                    setIrqState(IRQ_TX_MAILBOX_E, CAN::State::ENABLE);
                }
            } else 
            {
                result = false;
            }
        }
        // else: Sent directly and buffer is empty. Do NOT enable TX IRQ.
        // We leave the ISR disabled if we successfully sent directly and didn't add to buffer.
    }

    return result;
}

uint32_t GD32CAN::availableForWrite(void)
{
    // Start with available space in the ring buffer (if initialized)
    uint32_t result {(0 != _txRing.size) ? (_txRing.size - ringBufferCount(_txRing)) : 0};

    // Read the Transmit Status Register
    uint32_t tstat {CAN_TSTAT(_deviceBase)};

    // Check each mailbox empty flag manually using bitwise AND.
    if (tstat & CAN_TSTAT_TME0) 
    {
        result++;
    }
    if (tstat & CAN_TSTAT_TME1) 
    {
        result++;
    }
    if (tstat & CAN_TSTAT_TME2) 
    {
        result++;
    }

    return result;
}

uint32_t GD32CAN::available(void)
{
    return (ringBufferCount(_rxRing) + (uint32_t)can_receive_message_length_get(_deviceBase, CAN_FIFO0));
}

bool GD32CAN::peek(CAN::message_t &message)
{
    bool result {_isInitialized};

    if (true == result)
    {
        if (true == *_rxIrqEnabled)
        {
            setIrqState(IRQ_RX_FIFO_NE, CAN::State::DISABLE);
        }
        result = readFromRingBuffer(_rxRing, message);
        if (true == *_rxIrqEnabled)
        {
            setIrqState(IRQ_RX_FIFO_NE, CAN::State::ENABLE);
        }
    }

    return result;
}

bool GD32CAN::read(CAN::message_t &message)
{
    bool result {_isInitialized};

    if (true == result)
    {
        if (true == *_rxIrqEnabled)
        {
            setIrqState(IRQ_RX_FIFO_NE, CAN::State::DISABLE);
        } else
        {
            *_rxIrqEnabled = true;
        }

        result = readFromRingBuffer(_rxRing, message);

        if (true == result)
        {
            removeFromRingBuffer(_rxRing);
        }

        setIrqState(IRQ_RX_FIFO_NE, CAN::State::ENABLE);
    }

    return result;
}

uint_fast8_t GD32CAN::getError(void)
{
    const uint_fast8_t  DATA_ERR_SHIFT  {4};
    const uint_fast8_t  PASSIVE_MASK    {1 << 1};
    const uint_fast8_t  BUS_OFF_MASK    {1 << 2};
    uint_fast8_t        result          {(uint_fast8_t)CAN::Error::NONE};

    if (true == _isInitialized)
    {
        uint_fast8_t tempVal {(uint_fast8_t)GET_BITS((uint32_t)(CAN_ERR(_deviceBase)), 0U, 6U)};

        if (0 != tempVal)
        {
            result |= (tempVal >> DATA_ERR_SHIFT);
            if (0 != (tempVal & BUS_OFF_MASK))
            {
                result |= (uint_fast8_t)CAN::Error::BUS_OFF;
            } else
            {
                if (0 != (tempVal & PASSIVE_MASK))
                {
                    result |= (uint_fast8_t)CAN::Error::PASSIVE;
                } else
                {
                    result |= (uint_fast8_t)CAN::Error::WARNING;
                }
            }
        }
    }

    return result;
}

#if defined(HAS_CAN1)
bool GD32CAN::setCan1StartFilterId(CAN::Filter::Bank::filter_t filterId)
{
    bool result {_isInstanceAllowed && (INSTANCES_MASK_CAN1 == _instance_mask)};

    if (true == result)
    {
        can1_filter_start_bank((uint8_t)filterId);
        _firstFilterId = (int_fast8_t)filterId;
        can1StartFilterId = (int_fast8_t)filterId;
    }

    return result;
}
#endif


//*******************************************************************
//*                                                                 *
//*                       protected functions                       *
//*                                                                 *
//*******************************************************************

inline void GD32CAN::detachTransceiverSleepPin(void)
{
    if (NO_PIN != _transceiverSleepPin)
    {
        digitalWrite(_transceiverSleepPin, HIGH);
        pinMode(_transceiverSleepPin, INPUT);
    }
}

