michpro/arduino_libraries/GD32CAN/GD32CAN.cpp
void GD32CAN::canDeinit(void)
{
#if defined(HAS_CAN0)
    rcu_periph_reset_enum canDev {RCU_CAN0RST};

    switch (_deviceBase)
    {
    #if defined(HAS_CAN1)
    case (uint32_t)CAN1:
        canDev = RCU_CAN1RST;
        break;
    #endif
    #if defined(HAS_CAN2)
    case (uint32_t)CAN2:
        canDev = RCU_CAN2RST;
        break;
    #endif
    default:
        break;
    }

    rcu_periph_reset_enable(canDev);
    rcu_periph_reset_disable(canDev);
#endif
}

bool GD32CAN::canConfig(const CAN::Baudrate::baudrate_t baudrate)
{
    bool result {initCanHw(baudrate, CAN::State::ENABLE)};
    
    if (true == result)
    {
        #if defined(HAS_CAN1)
        setCan1StartFilterId((CAN::Filter::Bank::filter_t)DEFAULT_CAN1_START_FILTER_ID);
        #endif
        result = clearAllFilters();
    }

    return result;
}

inline uint32_t GD32CAN::calculateCANBTRegValue(const CAN::Baudrate::baudrate_t baudrate)
{
    uint32_t    result  {0};
    uint16_t    baudpsc {0};
    uint8_t     bs1     {0};
    uint8_t     bs2     {0};
    uint8_t     sjw     {0};

    if (true == calculateCANBTValues(baudrate, baudpsc, bs1, bs2, sjw))
    {
        result =  (BT_BS1((uint32_t)bs1))
                | (BT_BS2((uint32_t)bs2))
                | (((uint32_t)sjw << 24) & CAN_SJW_MASK)
                | (((uint32_t)baudpsc)   & CAN_BAUDPSC_MASK);
    }

    return result;
}

/**
 * @brief Calculates timing parameters (prescaler, BS1, BS2) for a given baudrate.
 * Iteratively searches for optimal Time Quanta to minimize error.
 */
bool GD32CAN::calculateCANBTValues(const CAN::Baudrate::baudrate_t baudrate, uint16_t &baudpsc, uint8_t &bs1, uint8_t &bs2, uint8_t &sjw)
{
    bool result {false};

    if ((uint32_t)baudrate <= HW_MAX_BAUDRATE)                      // The maximum baud rate support to 1M
    {
        const uint32_t  MULTIPLIER      {1000000};
        const uint32_t  PERCENT_POINT   {(uint32_t)(87.5 * MULTIPLIER) / 100};
        const uint32_t  FREQ_MAX_DELTA  {1000};

        uint32_t        clockFreq       {rcu_clock_freq_get(CK_APB1)};
        uint32_t        baseQuanta      {16};
        uint32_t        timeQuanta      {0};
        uint32_t        freqDelta       {0};

        while (freqDelta <= FREQ_MAX_DELTA)                         // allow for a small frequency error - so you can calculate
        {                                                           // parameters for bitrates like 83333, 33333
            uint32_t offset {0};

            while (8 >= offset)                                     // Looking for a timeQuanta of between 8 and 18,
            {                                                       // start at 16 and work outwards
                bool quantaDown {0 == (clockFreq % (baudrate * (baseQuanta - offset)))};
                bool quantaUp   {(2 >= offset) && (0 == (clockFreq % (baudrate * (baseQuanta + offset))))};
                if ((true == quantaDown) || (true == quantaUp))
                {
                    timeQuanta = (true == quantaDown) ? (baseQuanta - offset) : (baseQuanta + offset);
                    result = true;
                    break;
                }

                offset += 1;
            }
            if (true == result)
            {
                break;
            }
            clockFreq -= 1;
            freqDelta += 1;
        }

        uint32_t tempBs1 {uint32_t(PERCENT_POINT * timeQuanta) - (1 * MULTIPLIER)};

        baudpsc = clockFreq / (baudrate * timeQuanta);
        sjw = CAN_BT_SJW_1TQ;

        if (0x0F >= (tempBs1 / MULTIPLIER))
        {
            uint32_t samplePointA {((1 * MULTIPLIER) + tempBs1) / timeQuanta};
            uint32_t samplePointB {((2 * MULTIPLIER) + tempBs1) / timeQuanta};

            if (abs((int32_t)(samplePointB - PERCENT_POINT)) < abs((int32_t)(samplePointA - PERCENT_POINT)))
            {
                tempBs1 += MULTIPLIER;
            }
        }

        bs1 = (tempBs1 / MULTIPLIER) - 1;
        bs2 = timeQuanta - bs1 - 3;
    }

    return result;
}

void GD32CAN::gpioConfig(const CAN::State::state_t state)
{
    const uint32_t  CAN0_DEFAULT_REMAP  {(uint32_t)0x001D0000U | PCF0_CAN_REMAP(0)};
    #if defined(HAS_CAN1) || defined(HAS_CAN2)
    const uint32_t  CAN1_DEFAULT_REMAP  {(uint32_t)0x00200000U | PCF0_CAN_REMAP(0)};

    bool            canBeSet        {true};
    #endif
    rcu_periph_enum canPeriph       {RCU_CAN0};                     // settings for CAN0 attached to default IO PA11/PA12
    rcu_periph_enum gpioPeriph      {RCU_GPIOA};
    uint32_t        gpioPort        {GPIOA};
    uint32_t        pinRx           {GPIO_PIN_11};
    uint32_t        pinTx           {GPIO_PIN_12};
    uint32_t        remap           {CAN0_DEFAULT_REMAP};

    switch (_device)
    {
        case CAN::Device::CAN_0_ALT1:
            gpioPeriph = RCU_GPIOB;
            gpioPort = GPIOB;
            pinRx = GPIO_PIN_8;
            pinTx = GPIO_PIN_9;
        #if defined(GD32F30X_CL) || defined(GD32E50X_CL) || defined(GD32E508)
            remap = GPIO_CAN0_PARTIAL_REMAP;
        #else
            remap = GPIO_CAN_PARTIAL_REMAP;
        #endif
            break;
    #if defined(PD0)
        case CAN::Device::CAN_0_ALT2:
            gpioPeriph = RCU_GPIOD;
            gpioPort = GPIOD;
            pinRx = GPIO_PIN_0;
            pinTx = GPIO_PIN_1;
        #if defined(GD32F30X_CL) || defined(GD32E50X_CL) || defined(GD32E508)
            remap = GPIO_CAN0_FULL_REMAP;
        #else
            remap = GPIO_CAN_FULL_REMAP;
        #endif
            break;
    #endif
    #if defined(HAS_CAN1)
        case CAN::Device::CAN_1_DEFAULT:
            pinRx = GPIO_PIN_12;
            pinTx = GPIO_PIN_13;
            remap = CAN1_DEFAULT_REMAP;
            canBeSet = false;
        case CAN::Device::CAN_1_ALT1:
            canPeriph = RCU_CAN1;
            gpioPeriph = RCU_GPIOB;
            gpioPort = GPIOB;
            if (true == canBeSet)
            {
                pinRx = GPIO_PIN_5;
                pinTx = GPIO_PIN_6;
                remap = GPIO_CAN1_REMAP;
            }
            break;
    #endif
    #if defined(HAS_CAN2)
        case CAN::Device::CAN_2_DEFAULT:
            gpioPeriph = RCU_GPIOB;
            gpioPort = GPIOB;
            pinRx = GPIO_PIN_10;
            pinTx = GPIO_PIN_11;
            remap = CAN2_DEFAULT_REMAP;
            canBeSet = false;
        case CAN::Device::CAN_2_ALT1:
            if (true == canBeSet)
            {
                pinRx = GPIO_PIN_9;
                pinTx = GPIO_PIN_10;
                canBeSet = false;
                remap = GPIO_CAN2_PARTIAL_REMAP; 
            }
        #if defined(PE0)
        case CAN::Device::CAN_2_ALT2:
            if (true == canBeSet)
            {
                gpioPeriph = RCU_GPIOE;
                gpioPort = GPIOE;
                pinRx = GPIO_PIN_0;
                pinTx = GPIO_PIN_1;
                remap = GPIO_CAN2_FULL_REMAP; 
            }
        #endif
            canPeriph = RCU_CAN2;
            break;
    #endif
        default:
            break;
    }

    if (CAN::State::ENABLE == state)
    {
        /* enable CANx clock */
        rcu_periph_clock_enable(canPeriph);
    #if defined(HAS_CAN1)
        if ((RCU_CAN1 == canPeriph) && (0 == (instances & INSTANCES_MASK_CAN0)))
        {
            rcu_periph_clock_enable(RCU_CAN0);          // For CAN1 You need to enable CAN0 RCU clock even if it was not used.
        }
    #endif
        rcu_periph_clock_enable(gpioPeriph);
        rcu_periph_clock_enable(RCU_AF);
        
        /* configure CANx GPIO */
        gpio_init(gpioPort, GPIO_MODE_IPU,   GPIO_OSPEED_50MHZ, pinRx);
        gpio_init(gpioPort, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, pinTx);
        if (0 != remap)
        {
            gpio_pin_remap_config(remap, (ControlStatus)CAN::State::ENABLE);
        }
    } else
    {
        const uint8_t GPIO_SPEED_INPUT {(uint8_t)0x00U};

        gpio_pin_remap_config(remap, (ControlStatus)CAN::State::DISABLE);
        gpio_init(gpioPort, GPIO_MODE_IN_FLOATING, GPIO_SPEED_INPUT, pinRx);
        gpio_init(gpioPort, GPIO_MODE_IN_FLOATING, GPIO_SPEED_INPUT, pinTx);
        rcu_periph_clock_disable(canPeriph);
    #if defined(HAS_CAN1)
        if ((RCU_CAN1 == canPeriph) && (0 == (instances & INSTANCES_MASK_CAN0)))
        {
            rcu_periph_clock_disable(RCU_CAN0);
        }
    #endif
    }
}

void GD32CAN::nvicConfig(const CAN::State::state_t state)
{
    #if defined(GD32F30X_CL) || defined(GD32E50X_CL) || defined(GD32E508)
    uint8_t nvicTxIrq             {CAN0_TX_IRQn};
    uint8_t nvicRxIrq             {CAN0_RX0_IRQn};
    #else
    uint8_t nvicTxIrq             {USBD_HP_CAN0_TX_IRQn};
    uint8_t nvicRxIrq             {USBD_LP_CAN0_RX0_IRQn};
    #endif
    uint8_t nvicIrqPrePriority  {2}; 
    uint8_t nvicIrqSubPriority  {0};

    #if defined(HAS_CAN1)
    switch (_device)
    {
        case CAN::Device::CAN_1_DEFAULT:
        case CAN::Device::CAN_1_ALT1:
            nvicTxIrq = CAN1_TX_IRQn;
            nvicRxIrq = CAN1_RX0_IRQn;
            nvicIrqSubPriority = 1;
            break;
    #if defined(HAS_CAN2)
        case CAN::Device::CAN_2_DEFAULT:
        case CAN::Device::CAN_2_ALT1:
        #if defined(PE0)
        case CAN::Device::CAN_2_ALT2:
        #endif
            nvicTxIrq = CAN2_TX_IRQn;
            nvicRxIrq = CAN2_RX0_IRQn;
            nvicIrqSubPriority = 2;
            break;
    #endif
        default:
            break;
    }
    #endif

    if (CAN::State::ENABLE == state)
    {
        nvic_irq_enable(nvicRxIrq, nvicIrqPrePriority, nvicIrqSubPriority);
        nvic_irq_enable(nvicTxIrq, nvicIrqPrePriority, nvicIrqSubPriority);
    } else
    {
        nvic_irq_disable(nvicRxIrq);
        nvic_irq_disable(nvicTxIrq);
    }
}

bool GD32CAN::initCanHw(const CAN::Baudrate::baudrate_t baudrate, const CAN::State::state_t autoRetrans)
{
    bool                    result      {false};
    can_parameter_struct    parameters  {};

