michpro/arduino_libraries/GD32CAN/GD32CAN.cpp
    if (true == calculateCANBTValues(baudrate, parameters.prescaler, parameters.time_segment_1, parameters.time_segment_2, parameters.resync_jump_width))
    {
        parameters.working_mode = (uint8_t)CAN_NORMAL_MODE;
        parameters.time_triggered = (ControlStatus)DISABLE;
        parameters.rec_fifo_overwrite = (ControlStatus)DISABLE;
        parameters.auto_retrans = (ControlStatus)autoRetrans;
        parameters.trans_fifo_order = (ControlStatus)ENABLE;        // Order with first-in and first-out
        parameters.auto_bus_off_recovery = (ControlStatus)ENABLE;
        parameters.auto_wake_up = (ControlStatus)ENABLE;
        canDeinit();
        if (SUCCESS == can_init(_deviceBase, &parameters))
        {
            setIrqState((IRQ_RX_FIFO_NE | IRQ_TX_MAILBOX_E), CAN::State::ENABLE);
            result = true;
        }
    }

    return result;
}

void GD32CAN::setIrqState(const uint32_t irq, const CAN::State::state_t state)
{
    if (CAN::State::ENABLE == state)
    {
        can_interrupt_enable(_deviceBase, irq);
        if (IRQ_RX_FIFO_NE == (irq & IRQ_RX_FIFO_NE))
        {
            *_rxIrqEnabled = true;
        }
    } else
    {
        can_interrupt_disable(_deviceBase, irq);
        if (IRQ_RX_FIFO_NE == (irq & IRQ_RX_FIFO_NE))
        {
            *_rxIrqEnabled = false;
        }
    }
}

int_fast8_t GD32CAN::getMaxFilterId(void)
{
    int_fast8_t result {-1};

    switch (_device)
    {
        case CAN::Device::CAN_0_DEFAULT:
        case CAN::Device::CAN_0_ALT1:
    #if defined(PD0)
        case CAN::Device::CAN_0_ALT2:
    #endif
            result = (can1StartFilterId >= 0) ? (can1StartFilterId - 1) : (int_fast8_t)CAN::Filter::MAX_BANK;
            break;
    #if defined(HAS_CAN2)
        case CAN::Device::CAN_2_DEFAULT:
        case CAN::Device::CAN_2_ALT1:
        #if defined(PE0)
        case CAN::Device::CAN_2_ALT2:
        #endif
            result = (int_fast8_t)CAN::Filter::MAX_BANK_CAN2;
            break;
    #endif
        default:
            result = (int_fast8_t)CAN::Filter::MAX_BANK;
            break;
    }

    return result;
}

bool GD32CAN::setFilter(const CAN::Filter::Bank::filter_t filterId, const uint32_t frameId,    const uint32_t frameIdMask,
                        const CAN::Filter::Mode::mode_t filterMode, const scale_t filterScale, const CAN::State::state_t state)
{
    bool result {isFilterAvailable(filterId)};

    if (true == result)
    {
        can_filter_parameter_struct filter  {};
        uint32_t                    mask    {(uint32_t)(1 << (uint32_t)filterId)};

        _filtersStates |= mask;
        filter.filter_number = (uint16_t)filterId;
        filter.filter_mode = (uint16_t)filterMode;
        filter.filter_bits = (uint16_t)filterScale;
        filter.filter_fifo_number = CAN_FIFO0;
        filter.filter_enable = (ControlStatus)state;
        filter.filter_list_high = (uint16_t)(frameId >> CAN::Filter::HALFWORD_SHIFT);
        filter.filter_list_low = (uint16_t)(frameId & CAN_FILTER_MASK_16BITS);
        filter.filter_mask_high = (uint16_t)(frameIdMask >> CAN::Filter::HALFWORD_SHIFT);
        filter.filter_mask_low = (uint16_t)(frameIdMask & CAN_FILTER_MASK_16BITS);

        can_filter_init(&filter);
    }

    return result;
}

bool GD32CAN::setFilterState(const CAN::Filter::Bank::filter_t filterId, const CAN::State::state_t state)
{
    bool result {isFilterAvailable(filterId)};

    if (true == result)
    {
        uint32_t device {(uint32_t)CAN::Device::CAN_0_DEFAULT};
        uint32_t mask   {(uint32_t)(1 << (uint32_t)filterId)};

    #if defined(HAS_CAN2)
        switch (_device)
        {
            case CAN::Device::CAN_2_DEFAULT:
            case CAN::Device::CAN_2_ALT1:
        #if defined(PE0)
            case CAN::Device::CAN_2_ALT2:
        #endif
                device = (uint32_t)CAN::Device::CAN_2_DEFAULT;
                break;
            default:
                break;
        }
    #endif

        CAN_FCTL(device) |= CAN_FCTL_FLD;     // filter lock disable

        if (CAN::State::ENABLE == state)
        {
            if (0 != (_filtersStates & mask))
            {
                CAN_FW(device) |= mask;
            }
        } else
        {
            CAN_FW(device) &= ~mask;
        }

        CAN_FCTL(device) &= ~CAN_FCTL_FLD;    // filter lock enable
    }

    return result;
}

inline bool GD32CAN::isFilterAvailable(const CAN::Filter::Bank::filter_t filterId)
{
    return (_isInstanceAllowed && ((int_fast8_t)filterId >= _firstFilterId) && ((int_fast8_t)filterId <= getMaxFilterId()));
}

//*******************************************************************
//*                                                                 *
//*                         Free Functions                          *
//*                                                                 *
//*******************************************************************

//*************************** Ring Buffer ***************************

void initRingBuffer(volatile CAN::ringBuffer_t &ring, volatile CAN::message_t *buffer, uint32_t size)
{
    ring.buffer = buffer;
    ring.size = size;
    ring.head = 0;
    ring.tail = 0;
}

bool isRingBufferEmpty(volatile CAN::ringBuffer_t &ring)
{
    return ((ring.head == ring.tail) ? true : false);
}

bool isRingBufferFull(volatile CAN::ringBuffer_t &ring)
{
    return (((ring.head + 1) % ring.size) == ring.tail);
}

uint32_t ringBufferCount(volatile CAN::ringBuffer_t &ring)
{
    int32_t entries {(int32_t)ring.head - (int32_t)ring.tail};

    return ((entries < 0) ? ((uint32_t)(entries + (uint32_t)ring.size)) : (uint32_t)entries);
}

bool addToRingBuffer(volatile CAN::ringBuffer_t &ring, const CAN::message_t &message)
{
    uint_fast16_t   nextEntry   {(ring.head + 1) % ring.size};
    bool            result      {nextEntry != ring.tail};           // ring buffer is NOT full

    if (true == result)
    {
        memcpy((void *)&ring.buffer[ring.head], (void *)&message, sizeof(CAN::message_t));
        ring.head = nextEntry;
    }

    return result;
}

bool readFromRingBuffer(volatile CAN::ringBuffer_t &ring, CAN::message_t &message)
{
    bool result {true == (not isRingBufferEmpty(ring))};

    if (true == result)
    {
        memcpy((void *)&message, (void *)&ring.buffer[ring.tail], sizeof(CAN::message_t));
    }

    return result;
}

