michpro/arduino_libraries/GD32CAN/GD32CAN.cpp
void removeFromRingBuffer(volatile CAN::ringBuffer_t &ring)
{
    if (true == (not isRingBufferEmpty(ring)))
    {
        ring.tail = (ring.tail + 1) % ring.size;
    }
}

//*************************** CAN message ***************************

bool canMessageTransmit(uint32_t canPeriph, const CAN::message_t &message)
{
    can_trasnmit_message_struct tempMessage {};

    ((uint8_t)CAN::Frame::Id::EXTENDED == message.idType)   ? tempMessage.tx_efid = message.id
                                                            : tempMessage.tx_sfid = message.id;
    tempMessage.tx_ff = message.idType;
    tempMessage.tx_ft = message.frameType;
    tempMessage.tx_dlen = (message.dataLen <= CAN::MAX_DLC) ? message.dataLen : CAN::MAX_DLC;
    for (uint_fast8_t idx = 0; idx < CAN::MAX_DLC; idx++)
    {
        tempMessage.tx_data[idx] = message.data[idx];
    }

    return (CAN_NOMAILBOX != can_message_transmit(canPeriph, &tempMessage));
}

void canMessageReceive(uint32_t canPeriph, uint8_t fifo, CAN::message_t *rx_message)
{
    // CAN_RFIFOMI_FF (Bit 2) is 1 for Extended Frame -> goes to idType
    // CAN_RFIFOMI_FT (Bit 1) is 1 for Remote Frame -> goes to frameType
    rx_message->frameType = (uint8_t)(CAN_RFIFOMI_FT & CAN_RFIFOMI(canPeriph, fifo));
    rx_message->idType = (uint8_t)(CAN_RFIFOMI_FF & CAN_RFIFOMI(canPeriph, fifo));
    rx_message->id = (CAN_FF_STANDARD == rx_message->idType) ? (uint32_t)(GET_RFIFOMI_SFID(CAN_RFIFOMI(canPeriph, fifo)))
                                                             : (uint32_t)(GET_RFIFOMI_EFID(CAN_RFIFOMI(canPeriph, fifo)));

    uint8_t dlen {(uint8_t)(GET_RFIFOMP_DLENC(CAN_RFIFOMP(canPeriph, fifo)))};
    rx_message->dataLen = (dlen <= CAN::MAX_DLC) ? dlen : CAN::MAX_DLC;

    union Buffer
    {
        struct U32Data
        {
            uint32_t data3_0;
            uint32_t data7_4;
        }u32data;

        uint8_t u8data[CAN::MAX_DLC];
    };
    #if __BYTE_ORDER__ != __ORDER_LITTLE_ENDIAN__
        #error "Unsupported Endianness !!!"
    #endif
    Buffer buffer {};

    buffer.u32data.data3_0 = CAN_RFIFOMDATA0(canPeriph, fifo);
    buffer.u32data.data7_4 = CAN_RFIFOMDATA1(canPeriph, fifo);

    for (uint_fast8_t idx = 0; idx < CAN::MAX_DLC; idx++)
    {
        rx_message->data[idx] = buffer.u8data[idx];
    }

    // release FIFO
    (CAN_FIFO0 == fifo) ? (CAN_RFIFO0(canPeriph) |= CAN_RFIFO0_RFD0)
                        : (CAN_RFIFO1(canPeriph) |= CAN_RFIFO1_RFD1);
}

//*******************************************************************
//*                                                                 *
//*                        CAN IRQ Handlers                         *
//*                                                                 *
//*******************************************************************

inline __attribute__((always_inline)) void commonCanRxIrqHandler(const uint32_t canPeriph, volatile CAN::ringBuffer_t *ring, volatile bool &irqEnabledVar)
{
    if ((nullptr != ring) && (nullptr != ring->buffer))
    {
        if (false == isRingBufferFull(*ring))
        {
            CAN::message_t message;

            canMessageReceive(canPeriph, CAN_FIFO0, &message);
            (void)addToRingBuffer(*ring, message);
        } else
        {
            can_interrupt_disable(canPeriph, CAN_INT_RFNE0);
            irqEnabledVar = false;
        }
    }
}

inline __attribute__((always_inline)) void commonCanTxIrqHandler(const uint32_t canPeriph, volatile CAN::ringBuffer_t *ring)
{
    uint32_t mailboxes {CAN_TSTAT(canPeriph) & (CAN_TSTAT_MTF0 | CAN_TSTAT_MTF1 | CAN_TSTAT_MTF2)};

    if ((nullptr != ring) && (nullptr != ring->buffer))
    {
        CAN::message_t tempMessage;
        
        while (!isRingBufferEmpty(*ring)) 
        {
            // Peek at next message
            if (readFromRingBuffer(*ring, tempMessage))
            {
                // Try to transmit. If successful, remove from ring. 
                // If failed (HW full), break loop immediately to avoid blocking.
                if (true == canMessageTransmit(canPeriph, tempMessage))
                {
                    removeFromRingBuffer(*ring);
                } else 
                {
                    break;                                          // Mailboxes full, exit ISR immediately.
                }
            } else 
            {
                break;                                              // Should not happen given isRingBufferEmpty check, but safety first
            }
        }

        // If the ring buffer is empty after our work, we MUST disable the "Mailbox Empty" interrupt.
        // If we don't, this ISR will fire continuously (because the hardware mailbox is empty),
        // starving the main thread/RTOS and hanging the system.
        if (isRingBufferEmpty(*ring))
        {
            can_interrupt_disable(canPeriph, CAN_INT_TME);
        }
    }

    CAN_TSTAT(canPeriph) = mailboxes;
}

#if defined(HAS_CAN0)
    #if defined(GD32F30X_CL) || defined(GD32E50X_CL) || defined(GD32E508)
extern "C" void CAN0_RX0_IRQHandler(void)
{
    commonCanRxIrqHandler(CAN0, CAN::can0RxRing, CAN::can0rxIrqEnabled);
}

extern "C" void CAN0_TX_IRQHandler(void)
{
    commonCanTxIrqHandler(CAN0, CAN::can0TxRing);
}
    #else
extern "C" void USBD_LP_CAN0_RX0_IRQHandler(void)
{
    commonCanRxIrqHandler(CAN0, CAN::can0RxRing, CAN::can0rxIrqEnabled);
}

extern "C" void USBD_HP_CAN0_TX_IRQHandler(void)
{
    commonCanTxIrqHandler(CAN0, CAN::can0TxRing);
}
    #endif
#endif

#if defined(HAS_CAN1)
extern "C" void CAN1_RX0_IRQHandler(void)
{
    commonCanRxIrqHandler(CAN1, CAN::can1RxRing, CAN::can1rxIrqEnabled);
}

extern "C" void CAN1_TX_IRQHandler(void)
{
    commonCanTxIrqHandler(CAN1, CAN::can1TxRing);
}
#endif

#if defined(HAS_CAN2)
extern "C" void CAN2_RX0_IRQHandler(void)
{
    commonCanRxIrqHandler(CAN2, CAN::can2RxRing, CAN::can2rxIrqEnabled);
}

extern "C" void CAN2_TX_IRQHandler(void)
{
    commonCanTxIrqHandler(CAN2, CAN::can2TxRing);
}
#endif
